In [1]:
import csv
import pandas as pd
import sys
reload(sys)
sys.setdefaultencoding('utf8')
# -*- coding: utf-8 -*-
airbnb_total_df = pd.read_csv("listings.csv",low_memory=False)
airbnb_total_df.head()

In [2]:

airbnb_df = airbnb_total_df[["id","name","listing_url","neighbourhood","zipcode","price","weekly_price","property_type","room_type","monthly_price","accommodates","number_of_reviews","review_scores_rating","review_scores_location"]]
airbnb_df["name"] = airbnb_df["name"].str.decode('utf8')
airbnb_df["listing_url"]= airbnb_df["listing_url"]
airbnb_df.head()

,id,name,listing_url,neighbourhood,zipcode,price,weekly_price,property_type,room_type,monthly_price,accommodates,number_of_reviews,review_scores_rating,review_scores_location
0,2515,Stay at Chez Chic budget room #1,https://www.airbnb.com/rooms/2515,Harlem,10026,$59.00,$720.00,Apartment,Private room,"$1,690.00",3,173,93.0,9.0
1,2539,Clean & quiet apt home by the park,https://www.airbnb.com/rooms/2539,Kensington,11218,$149.00,$299.00,Apartment,Private room,$999.00,4,8,98.0,10.0
2,2595,Skylit Midtown Castle,https://www.airbnb.com/rooms/2595,Midtown,10018,$225.00,"$1,995.00",Apartment,Entire home/apt,NaN,2,36,94.0,10.0
3,3330,++ Brooklyn Penthouse Guestroom ++,https://www.airbnb.com/rooms/3330,Williamsburg,11206,$70.00,$650.00,Apartment,Private room,"$1,900.00",2,34,97.0,10.0
4,3647,THE VILLAGE OF HARLEM....NEW YORK !,https://www.airbnb.com/rooms/3647,Harlem,10027,$150.00,NaN,Apartment,Private room,NaN,2,0,NaN,NaN

In [3]:
airbnb_address_df = airbnb_total_df[["id","neighbourhood","zipcode","latitude","longitude"]]
airbnb_address_df.head()

     id neighbourhood zipcode   latitude  longitude
0  2515        Harlem   10026  40.799205 -73.953676
1  2539    Kensington   11218  40.647486 -73.972370
2  2595       Midtown   10018  40.753621 -73.983774
3  3330  Williamsburg   11206  40.708558 -73.942362
4  3647        Harlem   10027  40.809018 -73.941902

In [4]:
airbnb_roomtype = airbnb_df[["id","price","weekly_price","property_type","room_type","monthly_price","accommodates"]]
airbnb_roomtype.head()

,id,price,weekly_price,property_type,room_type,monthly_price,accommodates
0,2515,$59.00,$720.00,Apartment,Private room,"$1,690.00",3
1,2539,$149.00,$299.00,Apartment,Private room,$999.00,4
2,2595,$225.00,"$1,995.00",Apartment,Entire home/apt,NaN,2
3,3330,$70.00,$650.00,Apartment,Private room,"$1,900.00",2
4,3647,$150.00,NaN,Apartment,Private room,NaN,2

In [5]:
airbnb_roomreview = airbnb_df[["id","number_of_reviews","review_scores_rating","review_scores_location"]]
airbnb_roomreview.head()

     id  number_of_reviews  review_scores_rating  review_scores_location
0  2515                173                  93.0                     9.0
1  2539                  8                  98.0                    10.0
2  2595                 36                  94.0                    10.0
3  3330                 34                  97.0                    10.0
4  3647                  0                   NaN                     NaN

In [6]:
airbnb_host_df = airbnb_total_df[["id","host_id","host_url","host_name"]]

airbnb_host_df.head()

     id  host_id                                host_url  host_name
0  2515     2758  https://www.airbnb.com/users/show/2758      Steph
1  2539     2787  https://www.airbnb.com/users/show/2787       John
2  2595     2845  https://www.airbnb.com/users/show/2845   Jennifer
3  3330     4177  https://www.airbnb.com/users/show/4177       Jbee
4  3647     4632  https://www.airbnb.com/users/show/4632  Elisabeth

In [7]:
yelp_total_df = pd.read_json("yelp_nyc.json")
yelp_total_df.head()

,CAMIS,address,categories,city,id,latitude,longitude,name,phone,price,rating,review_count,state,transactions,url,zip_code
0,41183771,1 Battery Park Plz,['legalservices'],New York,hughes-hubbard-and-reed-llp-new-york-2,40.703330,-74.014120,"Hughes Hubbard & Reed, LLP",12128376000,,5.0,1,NY,,https://www.yelp.com/biz/hughes-hubbard-and-re...,10004
1,41338317,1 Beard St,"['scandinavian', 'hotdogs']",Brooklyn,ikea-restaurant-brooklyn,40.671485,-74.011238,IKEA Restaurant,18888884532,1,3.0,165,NY,,https://www.yelp.com/biz/ikea-restaurant-brook...,11231
2,40365043,1 Bouck Ct,['bowling'],Brooklyn,shell-lanes-brooklyn,40.588973,-73.973625,Shell Lanes,17183366700,,3.0,76,NY,,https://www.yelp.com/biz/shell-lanes-brooklyn?...,11223
3,50059683,1 Broadway,"['coffee', 'bakeries']",New York,filicori-zecchini-new-york-11,40.704900,-74.014160,Filicori Zecchini,,2,4.0,20,NY,,https://www.yelp.com/biz/filicori-zecchini-new...,10004
4,50033195,1 Catherine St,['bubbletea'],New York,gong-cha-new-york-12,40.713861,-73.997392,Gong Cha,12123437019,1,3.5,64,NY,,https://www.yelp.com/biz/gong-cha-new-york-12?...,10038

In [8]:
yelp_df = yelp_total_df[["id","name","categories","url","price","rating","review_count"]]
print(yelp_df.dtypes)
yelp_df.head()

,id,name,categories,url,price,rating,review_count
0,hughes-hubbard-and-reed-llp-new-york-2,"Hughes Hubbard & Reed, LLP",['legalservices'],https://www.yelp.com/biz/hughes-hubbard-and-re...,,5.0,1
1,ikea-restaurant-brooklyn,IKEA Restaurant,"['scandinavian', 'hotdogs']",https://www.yelp.com/biz/ikea-restaurant-brook...,1,3.0,165
2,shell-lanes-brooklyn,Shell Lanes,['bowling'],https://www.yelp.com/biz/shell-lanes-brooklyn?...,,3.0,76
3,filicori-zecchini-new-york-11,Filicori Zecchini,"['coffee', 'bakeries']",https://www.yelp.com/biz/filicori-zecchini-new...,2,4.0,20
4,gong-cha-new-york-12,Gong Cha,['bubbletea'],https://www.yelp.com/biz/gong-cha-new-york-12?...,1,3.5,64

In [9]:
yelp_address_df = yelp_total_df[["id","city","address","latitude","longitude","zip_code"]]
yelp_address_df.head()

,id,city,address,latitude,longitude,zip_code
0,hughes-hubbard-and-reed-llp-new-york-2,New York,1 Battery Park Plz,40.703330,-74.014120,10004
1,ikea-restaurant-brooklyn,Brooklyn,1 Beard St,40.671485,-74.011238,11231
2,shell-lanes-brooklyn,Brooklyn,1 Bouck Ct,40.588973,-73.973625,11223
3,filicori-zecchini-new-york-11,New York,1 Broadway,40.704900,-74.014160,10004
4,gong-cha-new-york-12,New York,1 Catherine St,40.713861,-73.997392,10038

In [10]:
airbnb_df.to_csv("airbnb.csv",index = False)
airbnb_roomtype.to_csv("airbnb_roomtype.csv",index=False)
airbnb_roomreview.to_csv("airbnb_roomreview.csv",index = False)
airbnb_host_df.to_csv("airbnb_host.csv",index = False)

In [11]:
airbnb_address_df.to_csv("airbnb_address.csv",index = False)

In [12]:
yelp_address_df.to_csv("yelp_address.csv",index = False)
yelp_df.to_csv("yelp.csv",index = False)